let a = 1, b = 1;
let c = ++a; //2
let d = c++; //d=2  c=3

// როცა ცვლადის წინ არის დაწერილი ინკრემენტი, ჯერ მოხდება ცვლადის გაზრდა,
//და მერე გაზრდილი მნიშვნელობის მინიჭება ტოლობის მარცხენა მხარისთვის
//ხოლო თუ ინკრემენტი არის დაწერილი ცვლადის მარჯვენა მხარეს, ეს ნიშნავს იმას რომ
//ჯერ მიენიჭება გაუზრდელი ცლვადის მნიშვნელობა და შემდეგ მოხდება ცლვადის გაზრდა
            
alert(a); // 2
alert(c); // 3
alert(d++); // 2; გამოიტანა d-ს მნიშნვნელობა 2, და ამის მერე გაიზარდა თავი d-მ, d რომ
            // გამოვიტანოთ ამის მერე მისი მნიშვნელობა იქნება 1-ით გაზრდილი